DataProcessors/ПанелиПростойИнтерфейс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПанелиПростойИнтерфейс</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/МестонахождениеОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеОСБухгалтерскийУчет</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений "Работники организаций"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеВАренду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеВАренду</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.МестонахождениеОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ДанныеПредметовАренды</xr:Item>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСНалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.СпособыОтраженияРасходовПоАренднымПлатежамОСНалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.СобытияОСОрганизаций</xr:Item>
				<xr:Item>InformationRegister.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияОСБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.НДСРаздельныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.СостоянияОСОрганизаций</xr:Item>
				<xr:Item>InformationRegister.РублевыеСуммыДокументовВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.НДСПоПриобретеннымЦенностям</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.РасчетПереоценкиВалютныхСредств</xr:Item>
				<xr:Item>InformationRegister.СчетаБухгалтерскогоУчетаОС</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияОСНалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.НачислениеАмортизацииОСНалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключенВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеВАренду</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛизингДоФСБУ25</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйУчетИмуществаВедетЛизингополучатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОценкиАрендыБУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценкиБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаДисконтирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьКУчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходовПоАмортизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияРасходовПоАренднымПлатежам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереходНаФСБУ25</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвансовыеПлатежи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьОбязательства</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредметыЛизинга</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредметыАренды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредметАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыЛизингодателя</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценкаБУ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНачисленияАмортизации</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСПлатежа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПанелиПростойИнтерфейс/Forms/ПанельИмущество/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаПодключаемыеКомандыОС;
	ПараметрыРазмещения.ВладелецКоманд = Элементы.СписокОС;
	ПараметрыРазмещения.Источники = Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства");
	ПараметрыРазмещения.ПрефиксГрупп = "ОС";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаПодключаемыеКомандыНМА;
	ПараметрыРазмещения.ВладелецКоманд = Элементы.СписокНМА;
	ПараметрыРазмещения.Источники = Новый ОписаниеТипов("СправочникСсылка.НематериальныеАктивы");
	ПараметрыРазмещения.ПрефиксГрупп = "НМА";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОтображатьДополнительныеКолонки = Константы.ОтображатьДополнительнуюИнформациюВСпискеИмущество.ПолучитьЗначение();
	УстановитьВидимостьЭлементовФормы();
	
	ИспользоватьНесколькоОрганизаций = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизацийБухгалтерскийУчет");
	
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	ОтборОрганизация = ОсновнаяОрганизация;
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	
	УстановитьОтборПоОрганизации();
	
	УстановитьУсловноеОформление();
	
	АдресТекстаЗапросаДополнительныхДанных = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	НастройкиСписка = Новый Структура;
	НастройкиСписка.Вставить("АдресТекстаЗапросаДополнительныхДанных", АдресТекстаЗапросаДополнительныхДанных);
	СписокОС.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("НастройкиСписка", НастройкиСписка);
	
	ВедетсяУчетОС = ПолучитьФункциональнуюОпцию("ВедетсяУчетОсновныхСредств");
	ВедетсяУчетНМА = ПолучитьФункциональнуюОпцию("ВедетсяУчетНМА");
	
	Элементы.ВедомостьЭлементовАмортизацииОткрытьОС.Видимость = ВедетсяУчетОС;
	Элементы.ВедомостьЭлементовАмортизацииОткрытьНМА.Видимость = ВедетсяУчетНМА;
	Элементы.ГруппаПодключаемыеКомандыНМА.Видимость = ВедетсяУчетНМА;
	
	ЗаполнитьВидыИмущества(ВедетсяУчетОС, ВедетсяУчетНМА);
	
	ПомеченныеНаУдалениеСервер.СкрытьПомеченныеНаУдаление(ЭтотОбъект, "СписокОС");
	ПомеченныеНаУдалениеСервер.СкрытьПомеченныеНаУдаление(ЭтотОбъект, "СписокНМА");
	
	МобильныйКлиентАдаптацияФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПредыдущийВариантОтображенияСпискаОС = Элементы.СписокОС.Отображение;
	
	ПриВыбореВидаИмущества();
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 1, Истина);
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ПерсонализированныеПредложенияСервисовКлиент.ПерейтиПоСсылкеБаннера(
		НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Баннер, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОсновнаяОрганизация = Параметр;
		Если ОсновнаяОрганизация <> ОтборОрганизация Тогда
			ОтборОрганизация = ОсновнаяОрганизация;
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
			ПриИзмененииОрганизации();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененаИнформацияОС" Или ИмяСобытия = "ИзмененОбъектОС" Тогда
		Элементы.СписокОС.Обновить();
		ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	ИначеЕсли ИмяСобытия = "ИзмененаИнформацияНМА" Или ИмяСобытия = "Запись_НематериальныйАктив" Тогда
		Элементы.СписокНМА.Обновить();
		ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	ИначеЕсли ИмяСобытия = "ПоказатьИнформациюОПравеПримененияСпецрежима" Тогда
		Если Источник <> ЭтотОбъект И (Не ОтборОрганизацияИспользование Или Параметр = ОтборОрганизация) Тогда
			ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(ВидИмущества)
		И Элементы.ВидИмущества.СписокВыбора.НайтиПоЗначению(ВидИмущества) = Неопределено Тогда
		ВидИмущества = Элементы.ВидИмущества.СписокВыбора[0].Значение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		ОтборОрганизация = ОсновнаяОрганизация;
		ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		УстановитьОтборПоОрганизации();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗакрытьБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.ЗакрытьБаннер(ЭтотОбъект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущийБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.УстановитьРежимОжиданияНаБаннере(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьПредыдущийБаннер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СледующийБаннерНажатие(Элемент)
	
	ОтключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер");
	
	ПерсонализированныеПредложенияСервисовКлиент.УстановитьРежимОжиданияНаБаннере(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееНажатие(Элемент)
	
	КонтрольПраваПримененияСпецрежимаКлиент.ПодробнееНажатие(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НапомнитьПозжеНажатие(Элемент)
	
	ОтложитьПоказНапоминанияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	ПриИзмененииОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	ПриИзмененииОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИмуществаПриИзменении(Элемент)
	
	ПриВыбореВидаИмущества();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНМА

&НаКлиенте
Процедура СписокНМАПриИзменении(Элемент)
	
	ПомеченныеНаУдалениеКлиент.ПриИзмененииСписка(ЭтотОбъект, Элемент);
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СписокНМАПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	ПомеченныеНаУдалениеСервер.УдалитьОтборПометкаУдаления(Настройки);
	ОбщегоНазначенияБП.ВосстановитьОтборСписка(СписокНМА, Настройки, "Организация");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНМАПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОС

&НаКлиенте
Процедура СписокОСПриИзменении(Элемент)
	
	ПомеченныеНаУдалениеКлиент.ПриИзмененииСписка(ЭтотОбъект, Элемент);
	
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СписокОСПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	ПомеченныеНаУдалениеСервер.УдалитьОтборПометкаУдаления(Настройки);
	ОбщегоНазначенияБП.ВосстановитьОтборСписка(СписокОС, Настройки, "Организация");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОСПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокОСПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	НастройкиСписка = Настройки.ДополнительныеСвойства.НастройкиСписка;
	
	Если Строки.Количество() > 0 Тогда
		
		ТекстЗапроса = ПолучитьИзВременногоХранилища(НастройкиСписка.АдресТекстаЗапросаДополнительныхДанных);
		Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
			
			ОсновныеСредства = Новый ТаблицаЗначений();
			ОсновныеСредства.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
			ОсновныеСредства.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
			
			Для Каждого СтрокаОС Из Строки Цикл
				ДанныеСтроки = СтрокаОС.Значение.Данные;
				НоваяСтрока = ОсновныеСредства.Добавить();
				НоваяСтрока.ОсновноеСредство = ДанныеСтроки.Ссылка;
				НоваяСтрока.Организация = ДанныеСтроки.Организация;
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("ОсновныеСредства", ОсновныеСредства);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Строка = Строки.Получить(Выборка.ОсновноеСредство);
				ЗаполнитьЗначенияСвойств(Строка.Данные, Выборка);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьГруппыОС(Команда)
	
	Если Элементы.ПоказыватьГруппыОС.Пометка Тогда
		ГруппыОССкрыть();
	Иначе
		ГруппыОСПоказать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеОсновныеСредства(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокументаПоступления(СписокОС,
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ОсновныеСредства"));
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриобретениеЗемельныхУчастков(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокументаПоступления(СписокОС,
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ПриобретениеЗемельныхУчастков"));
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеВАренду(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокументаПоступления(СписокОС,
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВАренду.ПоступлениеВАренду"));
	ОткрытьФорму("Документ.ПоступлениеВАренду.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеВЛизинг(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокументаПоступления(СписокОС,
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВАренду.ПоступлениеВЛизинг"));
	ОткрытьФорму("Документ.ПоступлениеВАренду.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриобретениеПрав(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокументаПоступления(СписокНМА,
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Права"));
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеНМА(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокументаПоступления(СписокНМА);
	ОткрытьФорму("Документ.ПоступлениеНМА.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНачалоСтадииРазработкиНМА(Команда)
	
	СтруктураПараметров = ПараметрыФормыДокументаПоступления(СписокНМА);
	ОткрытьФорму("Документ.НачалоСтадииРазработокНМА.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРегистрацияЗемельногоУчастка(Команда)
	
	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И НЕ ТекущиеДанные.ЭтоГруппа Тогда
		
		СтруктураПараметров = ПараметрыФормыРегистрацииОС(ТекущиеДанные.Ссылка,
			ПредопределенноеЗначение("Перечисление.ВидЗаписиОРегистрации.Регистрация"));
		ОткрытьФорму("РегистрСведений.РегистрацияЗемельныхУчастков.ФормаЗаписи", СтруктураПараметров, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСнятиеСРегистрацииЗемельногоУчастка(Команда)
	
	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И НЕ ТекущиеДанные.ЭтоГруппа Тогда
		
		СтруктураПараметров = ПараметрыФормыРегистрацииОС(ТекущиеДанные.Ссылка,
			ПредопределенноеЗначение("Перечисление.ВидЗаписиОРегистрации.СнятиеСРегистрационногоУчета"));
		ОткрытьФорму("РегистрСведений.РегистрацияЗемельныхУчастков.ФормаЗаписи", СтруктураПараметров, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРегистрацияТранспортногоСредства(Команда)
	
	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И НЕ ТекущиеДанные.ЭтоГруппа Тогда
		
		СтруктураПараметров = ПараметрыФормыРегистрацииОС(ТекущиеДанные.Ссылка,
			ПредопределенноеЗначение("Перечисление.ВидЗаписиОРегистрации.Регистрация"));
		ОткрытьФорму("РегистрСведений.РегистрацияТранспортныхСредств.ФормаЗаписи", СтруктураПараметров, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСнятиеСРегистрацииТранспортногоСредства(Команда)
	
	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И НЕ ТекущиеДанные.ЭтоГруппа Тогда
		
		СтруктураПараметров = ПараметрыФормыРегистрацииОС(ТекущиеДанные.Ссылка,
			ПредопределенноеЗначение("Перечисление.ВидЗаписиОРегистрации.СнятиеСРегистрационногоУчета"));
		ОткрытьФорму("РегистрСведений.РегистрацияТранспортныхСредств.ФормаЗаписи", СтруктураПараметров, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПринятиеКУчетуОС(Команда)
	
	ТекущиеДанные = Элементы.СписокОС.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И НЕ ТекущиеДанные.ЭтоГруппа Тогда
		
		ЗначенияЗаполнения = Новый Структура;
		Если ОтборОрганизацияИспользование Тогда
			ЗначенияЗаполнения.Вставить("Организация", ОтборОрганизация);
		КонецЕсли;
		ЗначенияЗаполнения.Вставить("ОсновноеСредство", ТекущиеДанные.Ссылка);
		ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.ПринятиеКУчетуОС.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление(ВыделяемыеЗначения = Неопределено)
	
	УсловноеОформление.Элементы.Очистить();
	
	// Организация
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокОСОрганизация");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокНМАОрганизация");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизацияИспользование", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборОрганизация", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ПравоПоступлениеТоваровУслуг = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ПоступлениеТоваровУслуг);
	ПравоПоступлениеВАренду = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ПоступлениеВАренду);
	ПравоПоступлениеНМА = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.ПоступлениеНМА);
	ПравоНачалоСтадииРазработокНМА = ПравоДоступа("ИнтерактивноеДобавление", Метаданные.Документы.НачалоСтадииРазработокНМА);
	ПравоРегистрацияЗемельныхУчастков = ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.РегистрацияЗемельныхУчастков);
	ПравоРегистрацияТранспортныхСредств = ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.РегистрацияТранспортныхСредств);
	
	Элементы.СоздатьПоступлениеОсновныеСредства.Видимость = ПравоПоступлениеТоваровУслуг;
	Элементы.СоздатьПриобретениеЗемельныхУчастков.Видимость = ПравоПоступлениеТоваровУслуг;
	Элементы.СоздатьПоступлениеВАренду.Видимость = ПравоПоступлениеВАренду;
	Элементы.СоздатьПоступлениеВЛизинг.Видимость = ПравоПоступлениеВАренду;
	
	Элементы.СоздатьПоступлениеНМА.Видимость = ПравоПоступлениеНМА;
	Элементы.СоздатьПриобретениеПрав.Видимость = ПравоПоступлениеТоваровУслуг;
	Элементы.СоздатьНачалоСтадииРазработкиНМА.Видимость = ПравоНачалоСтадииРазработокНМА;
	
	Элементы.СоздатьРегистрацияЗемельногоУчастка.Видимость = ПравоРегистрацияЗемельныхУчастков;
	Элементы.СоздатьСнятиеСРегистрацииЗемельногоУчастка.Видимость = ПравоРегистрацияЗемельныхУчастков;
	Элементы.СоздатьРегистрацияТранспортногоСредства.Видимость = ПравоРегистрацияТранспортныхСредств;
	Элементы.СоздатьСнятиеСРегистрацииТранспортногоСредства.Видимость = ПравоРегистрацияТранспортныхСредств;
	
	Элементы.СписокОССостояние.Видимость = ОтображатьДополнительныеКолонки;
	Элементы.СписокОСОтветственный.Видимость = ОтображатьДополнительныеКолонки;
	Элементы.СписокОСМестонахождение.Видимость = ОтображатьДополнительныеКолонки;
	
	Элементы.СписокНМАСостояние.Видимость = ОтображатьДополнительныеКолонки;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыФормыДокументаПоступления(Список, ВидОперации = Неопределено)
	
	СтруктураПараметров = Новый Структура;
	ЗначенияЗаполнения = ОбщегоНазначенияБПВызовСервера.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);
	Если ЗначениеЗаполнено(ВидОперации) Тогда
		ЗначенияЗаполнения.Вставить("ВидОперации", ВидОперации);
	КонецЕсли;
	Если ОтборОрганизацияИспользование Тогда
		ЗначенияЗаполнения.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Функция ПараметрыФормыРегистрацииОС(ОсновноеСредство, ВидЗаписи)
	
	ЗначенияЗаполнения = ОбщегоНазначенияБПВызовСервера.ЗначенияЗаполненияДинамическогоСписка(СписокОС.КомпоновщикНастроек);
	ЗначенияЗаполнения.Вставить("ВидЗаписи", ВидЗаписи);
	ЗначенияЗаполнения.Вставить("ОсновноеСредство", ОсновноеСредство);
	Если ОтборОрганизацияИспользование Тогда
		ЗначенияЗаполнения.Вставить("Организация", ОтборОрганизация);
	КонецЕсли;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВидыИмущества(ВедетсяУчетОС, ВедетсяУчетНМА)
	
	СписокВыбора = Элементы.ВидИмущества.СписокВыбора;
	СписокВыбора.Очистить();
	
	Подсказки = Новый Массив;
	
	Если ВедетсяУчетОС Тогда
		
		ОсновныеСредства = СписокВыбора.Добавить();
		ОсновныеСредства.Значение = ВидОсновныеСредства();
		ОсновныеСредства.Представление = НСтр("ru = 'Все ОС'");
		
		ОсновныеСредства = СписокВыбора.Добавить();
		ОсновныеСредства.Значение = ВидТранспорт();
		ОсновныеСредства.Представление = НСтр("ru = 'Транспорт'");
		
		ОсновныеСредства = СписокВыбора.Добавить();
		ОсновныеСредства.Значение = ВидЗемля();
		ОсновныеСредства.Представление = НСтр("ru = 'Земля'");
		
		Подсказки.Добавить(НСтр("ru = 'ОС - основные средства'"));
		
	КонецЕсли;
	
	НематериальныеАктивы = СписокВыбора.Добавить();
	НематериальныеАктивы.Значение = ВидНематериальныеАктивы();
	Если ВедетсяУчетНМА Тогда
		НематериальныеАктивы.Представление = НСтр("ru = 'НМА'");
		Подсказки.Добавить(НСтр("ru = 'НМА - нематериальные активы'"));
	Иначе
		НематериальныеАктивы.Представление = НСтр("ru = 'Права'");
	КонецЕсли;
		
	ВидИмущества = СписокВыбора[0].Значение;
	Элементы.ВидИмущества.Видимость = СписокВыбора.Количество() > 1;
	Элементы.ВидИмущества.Подсказка = СтрСоединить(Подсказки, Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореВидаИмущества()
	
	ВыбранСписокНМА = ВидИмущества = ВидНематериальныеАктивы();
	
	Если ВыбранСписокНМА Тогда
		ПоказатьСтраницуНМА();
	Иначе
		ПоказатьСтраницуОС(ВидИмущества);
	КонецЕсли;
	
	Элементы.ГруппаДополнительныеОтборыОС.Видимость = Не ВыбранСписокНМА;
	Элементы.ГруппаДополнительныеОтборыНМА.Видимость = ВыбранСписокНМА;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоОрганизации()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокОС.КомпоновщикНастроек.Настройки.Отбор,
		"Организация",
		ОтборОрганизация,
		,
		,
		ИспользоватьНесколькоОрганизаций И ОтборОрганизацияИспользование);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		СписокНМА.КомпоновщикНастроек.Настройки.Отбор,
		"Организация",
		ОтборОрганизация,
		,
		,
		ИспользоватьНесколькоОрганизаций И ОтборОрганизацияИспользование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОрганизации()
	
	УстановитьОтборПоОрганизации();
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьБаннер", 0.1, Истина);
	ПодключитьОбработчикОжидания("ПоказатьИнформациюОПравеПримененияСпецрежима", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуОС(ВидИмущества)
	
	СписокВсеОС = ВидИмущества = ВидОсновныеСредства();
	СписокЗемля = ВидИмущества = ВидЗемля();
	СписокТранспорт = ВидИмущества = ВидТранспорт();
	
	Элементы.ГруппаСписки.ТекущаяСтраница = Элементы.ГруппаСписокОС;
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокОС, "ГруппаОС");
	
	Если СписокЗемля Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОС,
			"ГруппаОС", ПредопределенноеЗначение("Перечисление.ГруппыОС.ЗемельныеУчастки"));
	ИначеЕсли СписокТранспорт Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОС,
			"ГруппаОС", ПредопределенноеЗначение("Перечисление.ГруппыОС.ТранспортныеСредства"));
	КонецЕсли;
	
	Элементы.ПоказыватьГруппыОС.Видимость = Не СписокВсеОС;
	Если СписокВсеОС Тогда
		ГруппыОСПоказать();
	Иначе
		ГруппыОССкрыть();
	КонецЕсли;
	
	Элементы.СоздатьПриобретениеЗемельныхУчастков.Видимость = СписокВсеОС Или СписокЗемля;
	Элементы.СоздатьПоступлениеВЛизинг.Видимость = Не СписокЗемля;
	Элементы.ГруппаРегистрацияЗемельныхУчастковОС.Видимость = СписокЗемля;
	Элементы.ГруппаРегистрацияТранспортныхСредствОС.Видимость = СписокТранспорт;
	
	Элементы.СписокОСРегистрационныйЗнак.Видимость = СписокТранспорт И ОтображатьДополнительныеКолонки;
	Элементы.СписокОСКадастровыйНомер.Видимость = СписокЗемля И ОтображатьДополнительныеКолонки;
	
	Если ОтображатьДополнительныеКолонки Тогда
		ПоместитьТекстЗапросаДополнительныхДанныхОС(АдресТекстаЗапросаДополнительныхДанных, ВидИмущества);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуНМА()
	
	Элементы.ГруппаСписки.ТекущаяСтраница = Элементы.ГруппаСписокНМА;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыОСПоказать()
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокОС, "ЭтоГруппа");
	Элементы.СписокОС.Отображение = ПредыдущийВариантОтображенияСпискаОС;
	Элементы.ПоказыватьГруппыОС.Пометка = Истина;
	ГруппыОССкрыты = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыОССкрыть()
	
	Если ГруппыОССкрыты Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущийВариантОтображенияСпискаОС = Элементы.СписокОС.Отображение;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокОС, "ЭтоГруппа", Ложь);
	Элементы.СписокОС.Отображение = ОтображениеТаблицы.Список;
	Элементы.ПоказыватьГруппыОС.Пометка = Ложь;
	ГруппыОССкрыты = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВидОсновныеСредства()
	
	Возврат "ОсновныеСредства";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидТранспорт()
	
	Возврат "Транспорт";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидЗемля()
	
	Возврат "Земля";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидНематериальныеАктивы()
	
	Возврат "НематериальныеАктивы";
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПоместитьТекстЗапросаДополнительныхДанныхОС(Адрес, ВидИмущества)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.Организация КАК Организация
	|ПОМЕСТИТЬ ОсновныеСредства
	|ИЗ
	|	&ОсновныеСредства КАК ОсновныеСредства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МестонахождениеОСБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОСБУ.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА МестонахождениеОСБУ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА МестонахождениеОСБУ.Местонахождение
	|		ИНАЧЕ МестонахождениеОСБУ.Контрагент
	|	КОНЕЦ КАК Местонахождение,
	|	МестонахождениеОСБУ.МОЛ КАК Ответственный
	|ПОМЕСТИТЬ МестонахождениеОСБУ
	|ИЗ
	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(, (ОсновноеСредство, Организация) В
	|		(ВЫБРАТЬ
	|			ОсновныеСредства.ОсновноеСредство,
	|			ОсновныеСредства.Организация
	|		ИЗ
	|			ОсновныеСредства КАК ОсновныеСредства)) КАК МестонахождениеОСБУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОСБУ.Местонахождение КАК Местонахождение,
	|	МестонахождениеОСБУ.Ответственный КАК Ответственный
	|ИЗ
	|	ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОСБУ КАК МестонахождениеОСБУ
	|		ПО ОсновныеСредства.ОсновноеСредство = МестонахождениеОСБУ.ОсновноеСредство
	|		И ОсновныеСредства.Организация = МестонахождениеОСБУ.Организация";
	
	Если ВидИмущества = ВидЗемля() Тогда
		ДополнитьЗапросИнформациейПоЗемельнымУчасткам(ТекстЗапроса);
	ИначеЕсли ВидИмущества = ВидТранспорт() Тогда
		ДополнитьЗапросИнформациейПоТранспортнымСредствам(ТекстЗапроса);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ТекстЗапроса, Адрес);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьЗапросИнформациейПоЗемельнымУчасткам(ТекстЗапроса)
	
	ТекстЗапросаПоРегистрации =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.Организация,
	|	МАКСИМУМ(РегистрацияЗемельныхУчастков.Период) КАК Период
	|ПОМЕСТИТЬ ПоследняяРегистрацияЗемельныеУчастки
	|ИЗ
	|	ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
	|		ПО ОсновныеСредства.ОсновноеСредство = РегистрацияЗемельныхУчастков.ОсновноеСредство
	|		И ОсновныеСредства.Организация = РегистрацияЗемельныхУчастков.Организация
	|ГДЕ
	|	РегистрацияЗемельныхУчастков.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.Регистрация)
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.Организация";
	
	ТекстЗапросаПоЗемельнымУчасткам =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоследняяРегистрация.ОсновноеСредство,
	|	РегистрацияЗемельныхУчастков.КадастровыйНомер
	|ПОМЕСТИТЬ ЗемельныеУчастки
	|ИЗ
	|	ПоследняяРегистрацияЗемельныеУчастки КАК ПоследняяРегистрация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
	|		ПО ПоследняяРегистрация.ОсновноеСредство = РегистрацияЗемельныхУчастков.ОсновноеСредство
	|		И ПоследняяРегистрация.Организация = РегистрацияЗемельныхУчастков.Организация
	|		И ПоследняяРегистрация.Период = РегистрацияЗемельныхУчастков.Период";
	
	Схема = Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	ПоследнийЗапрос = Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество() - 1];
	
	НовыйЗапрос = Схема.ПакетЗапросов.Добавить();
	НовыйЗапрос.УстановитьТекстЗапроса(ТекстЗапросаПоРегистрации);
	НовыйЗапрос = Схема.ПакетЗапросов.Добавить();
	НовыйЗапрос.УстановитьТекстЗапроса(ТекстЗапросаПоЗемельнымУчасткам);
	
	Схема.ПакетЗапросов.Переместить(ПоследнийЗапрос, Схема.ПакетЗапросов.Количество() - 1);
	ПоследнийЗапрос.Операторы[0].Источники.Добавить("ЗемельныеУчастки", "ЗемельныеУчастки");
	ПоследнийЗапрос.Операторы[0].ВыбираемыеПоля.Добавить("ЗемельныеУчастки.КадастровыйНомер");
	ПоследнийЗапрос.Операторы[0].Источники[0].Соединения.Добавить("ЗемельныеУчастки",
		"ОсновныеСредства.ОсновноеСредство = ЗемельныеУчастки.ОсновноеСредство");
	
	ТекстЗапроса = Схема.ПолучитьТекстЗапроса();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьЗапросИнформациейПоТранспортнымСредствам(ТекстЗапроса)
	
	ТекстЗапросаПоРегистрации =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.Организация,
	|	МАКСИМУМ(РегистрацияТранспортныхСредств.Период) КАК Период
	|ПОМЕСТИТЬ ПоследняяРегистрацияТранспортныеСредства
	|ИЗ
	|	ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
	|		ПО ОсновныеСредства.ОсновноеСредство = РегистрацияТранспортныхСредств.ОсновноеСредство
	|		И ОсновныеСредства.Организация = РегистрацияТранспортныхСредств.Организация
	|ГДЕ
	|	РегистрацияТранспортныхСредств.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.Регистрация)
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.Организация";
	
	ТекстЗапросаПоТранспортнымСредствам =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоследняяРегистрация.ОсновноеСредство,
	|	РегистрацияТранспортныхСредств.РегистрационныйЗнак КАК РегистрационныйЗнак
	|ПОМЕСТИТЬ ТранспортныеСредства
	|ИЗ
	|	ПоследняяРегистрацияТранспортныеСредства КАК ПоследняяРегистрация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
	|		ПО ПоследняяРегистрация.ОсновноеСредство = РегистрацияТранспортныхСредств.ОсновноеСредство
	|		И ПоследняяРегистрация.Организация = РегистрацияТранспортныхСредств.Организация
	|		И ПоследняяРегистрация.Период = РегистрацияТранспортныхСредств.Период";
	
	Схема = Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	ПоследнийЗапрос = Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество() - 1];
	
	НовыйЗапрос = Схема.ПакетЗапросов.Добавить();
	НовыйЗапрос.УстановитьТекстЗапроса(ТекстЗапросаПоРегистрации);
	
	НовыйЗапрос = Схема.ПакетЗапросов.Добавить();
	НовыйЗапрос.УстановитьТекстЗапроса(ТекстЗапросаПоТранспортнымСредствам);
	
	Схема.ПакетЗапросов.Переместить(ПоследнийЗапрос, Схема.ПакетЗапросов.Количество() - 1);
	ПоследнийЗапрос.Операторы[0].Источники.Добавить("ТранспортныеСредства", "ТранспортныеСредства");
	ПоследнийЗапрос.Операторы[0].ВыбираемыеПоля.Добавить("ТранспортныеСредства.РегистрационныйЗнак");
	ПоследнийЗапрос.Операторы[0].Источники[0].Соединения.Добавить("ТранспортныеСредства",
		"ОсновныеСредства.ОсновноеСредство = ТранспортныеСредства.ОсновноеСредство");
	
	ТекстЗапроса = Схема.ПолучитьТекстЗапроса();
	
КонецПроцедуры

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область Баннер

&НаКлиенте
Процедура Подключаемый_УстановитьБаннер()
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьСледующийБаннер()
	
	// Поскольку обработчик может вызываться не только интерактивно пользователем,
	// но и автоматически по таймеру, меняем баннер при условии, что форма находится в фокусе.
	Если НЕ ВводДоступен() Тогда
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер",
			ПерсонализированныеПредложенияСервисовКлиент.ИнтервалПереключенияБаннеров(), Истина);
		Возврат;
	КонецЕсли;
	
	УстановитьБаннер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьПредыдущийБаннер()
	
	УстановитьБаннер(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБаннер(ПоказатьПредыдущий = Ложь)
	
	ДлительнаяОперация = ПолучитьБаннерНаСервере(ПоказатьПредыдущий);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
		
		Обработчик = Новый ОписаниеОповещения("ПослеПолученияБаннераВФоне", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияБаннераВФоне(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		УстановитьБаннерНаФорме(ДлительнаяОперация.АдресРезультата);
		ПодключитьОбработчикОжидания("Подключаемый_УстановитьСледующийБаннер",
			ПерсонализированныеПредложенияСервисовКлиент.ИнтервалПереключенияБаннеров(), Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБаннерНаСервере(ПоказатьПредыдущий)
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение баннера в фоне'");
	НастройкиЗапуска.ЗапуститьВФоне = Истина;
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Организация", Неопределено);
	СтруктураПараметров.Вставить("Размещение", ПерсонализированныеПредложенияСервисов.ИмяРазмещенияОсновныеСредства());
	СтруктураПараметров.Вставить("ПоказатьПредыдущий", ПоказатьПредыдущий);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ПерсонализированныеПредложенияСервисов.ПолучитьБаннер",
		СтруктураПараметров,
		НастройкиЗапуска);
	
КонецФункции

&НаСервере
Процедура УстановитьБаннерНаФорме(АдресРезультата)
	
	ПерсонализированныеПредложенияСервисов.УстановитьБаннерНаФорме(ЭтотОбъект, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область ПравоПримененияСпецрежима

&НаКлиенте
Процедура ПоказатьИнформациюОПравеПримененияСпецрежима()
	
	Если Не ОтборОрганизацияИспользование
		Или Не КонтрольПраваПримененияСпецрежимаКлиент.Контролировать(ОтборОрганизация) Тогда
		Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
	Иначе
		ПоказатьИнформациюОПравеПримененияСпецрежимаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьИнформациюОПравеПримененияСпецрежимаНаСервере()
	
	ИнформацияОПравеПримененияСпецрежима = КонтрольПраваПримененияСпецрежима.ИнформацияОПравеПримененияСпецрежима(
		ОтборОрганизация, 
		КонтрольПраваПримененияСпецрежима.ИмяПоказателяСпецрежимаОсновныеСредства());
	СледующееЗначениеНапоминания = ИнформацияОПравеПримененияСпецрежима.СледующееЗначениеНапоминания;
	СсылкаНаПояснение = ИнформацияОПравеПримененияСпецрежима.СсылкаНаПояснение;
	
	Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = ИнформацияОПравеПримененияСпецрежима.Показать;
	Элементы.ИнформацияОПравеПримененияСпецрежима.ЦветФона = ИнформацияОПравеПримененияСпецрежима.ЦветФонаГруппы;
	Элементы.ТекстИнформации.Заголовок = ИнформацияОПравеПримененияСпецрежима.ТекстИнформации;
	
	Элементы.Подробнее.Видимость = ЗначениеЗаполнено(СсылкаНаПояснение);
	
	Элементы.НапомнитьПозже.Заголовок = ИнформацияОПравеПримененияСпецрежима.ТекстНапомнитьПозже;
	Элементы.НапомнитьПозже.Видимость = ИнформацияОПравеПримененияСпецрежима.ОтображатьНапоминание;
	
КонецПроцедуры

&НаСервере
Процедура ОтложитьПоказНапоминанияНаСервере()
	
	КонтрольПраваПримененияСпецрежима.ОтложитьПоказНапоминания(
		ОтборОрганизация,
		КонтрольПраваПримененияСпецрежима.ИмяПоказателяСпецрежимаОсновныеСредства(),
		СледующееЗначениеНапоминания);
		
	Элементы.ИнформацияОПравеПримененияСпецрежима.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	МобильныйКлиентБПФормаСписка.НастроитьФормуОбъекта(ЭтотОбъект);
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКШапка(ЭтотОбъект, Элементы.ВидИмущества);
	Элементы.ВидИмущества.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКСписок(ЭтотОбъект, Элементы.ГруппаСписки);
	
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.Баннер);
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.ГруппаОсновное);
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.ГруппаШапка);
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.ГруппаКоманднаяПанельОС);
	МобильныйКлиентБПФормаСписка.СкрытьЭлементФормыСписка(ЭтотОбъект, Элементы.ГруппаКоманднаяПанельНМА);
	
	АдаптироватьМККоманднаяПанельФормы();
	
	АдаптироватьМКОтборыФормы();
	
	АдаптироватьМКСписокОСФормы();
	АдаптироватьМКСписокНМАФормы();
	
	АдаптироватьМККонтекстСписокОСФормы();
	АдаптироватьМККонтекстСписокНМАФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМККоманднаяПанельФормы()
	
	КомандыПоля = МобильныйКлиентБПФормаСписка.НовыйОписаниеКомандТабличноеПоле();
	//Выбор доступен всегда
	КомандыПоля.РазрешеноИзменение = Ложь;
	КомандыПоля.ДоступноУправлениеОтбором = Ложь;
	МобильныйКлиентБПФормаСписка.АдаптироватьМККоманднаяПанельФормы(ЭтотОбъект, КомандыПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаМКПоказатьСкрытьПрочиеКолонки(Команда)
	
	МобильныйКлиентБПФормаОбъектаКлиентСервер.УправлениеФормойСпискаКолонкаПрочее(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМККонтекстСписокОСФормы()

	МобильныйКлиентБПФормаОбъекта.АдаптироватьКонтекстноеМеню(ЭтотОбъект, ,"СписокОС");
	МобильныйКлиентБПФормаОбъекта.ПереместитьЭлементыФормы(Элементы,
		Элементы.ПодменюОтчетыОС.ПодчиненныеЭлементы,
		Элементы.СписокОС.КонтекстноеМеню);
	МобильныйКлиентБПФормаОбъекта.ПереместитьЭлементыФормы(Элементы,
		Элементы.ОСПодменюПечать.ПодчиненныеЭлементы,
		Элементы.СписокОС.КонтекстноеМеню);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМККонтекстСписокНМАФормы()

	МобильныйКлиентБПФормаОбъекта.АдаптироватьКонтекстноеМеню(ЭтотОбъект, ,"СписокНМА");
	МобильныйКлиентБПФормаОбъекта.ПереместитьЭлементыФормы(Элементы,
		Элементы.ПодменюОтчетыНМА.ПодчиненныеЭлементы,
		Элементы.СписокНМА.КонтекстноеМеню);
	МобильныйКлиентБПФормаОбъекта.ПереместитьЭлементыФормы(Элементы,
		Элементы.НМАПодменюПечать.ПодчиненныеЭлементы,
		Элементы.СписокНМА.КонтекстноеМеню);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКОтборыФормы()
	
	МобильныйКлиентБПФормаСписка.НастроитьФормуОтбораМК(ЭтотОбъект, "СписокОС", "Организация");
	МобильныйКлиентБПФормаСписка.АдаптироватьМКЭлементОтбораОрганизация(ЭтотОбъект,
		Элементы.ОтборОрганизация,
		"",
		"Все организации");
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКБыстрыеОтборы(ЭтотОбъект,
		Элементы.ГруппаДополнительныеОтборыОС);
	МобильныйКлиентБПФормаСписка.ВстроитьЭлементВГруппуМКБыстрыеОтборы(ЭтотОбъект,
		Элементы.ГруппаДополнительныеОтборыНМА);

КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКСписокОСФормы()
	
	ИменаВажныхЭлементов = Новый Массив;
	ИменаВажныхЭлементов.Добавить("СписокОСНаименование");
	ИменаВажныхЭлементов.Добавить("СписокОСИнвентарныйНомер");
	ИменаВажныхЭлементов.Добавить("СписокОСРегистрационныйЗнак");
	ИменаВажныхЭлементов.Добавить("СписокОСКадастровыйНомер");
	
	МобильныйКлиентБПФормаОбъекта.УстановитьВажностьКолонокТабличногоПоляФормы(Элементы.СписокОС.ПодчиненныеЭлементы,
		ИменаВажныхЭлементов);
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКСписокНМАФормы()
	
	ИменаВажныхЭлементов = Новый Массив;
	ИменаВажныхЭлементов.Добавить("СписокНМАНаименование");
	ИменаВажныхЭлементов.Добавить("СписокНМАСостояние");
	
	МобильныйКлиентБПФормаОбъекта.УстановитьВажностьКолонокТабличногоПоляФормы(Элементы.СписокНМА.ПодчиненныеЭлементы,
		ИменаВажныхЭлементов);
	
КонецПроцедуры


#КонецОбласти
